In [1]:
import pandas as pd

In [2]:
data1 = [
    ["Alice", 25],
    ["Bob", 30],
    ["Charlie", 35],
    ["Shrey",22],
    ["Kulwendra",23],
    ["Adi",24]
]

In [3]:
data1

[['Alice', 25],
 ['Bob', 30],
 ['Charlie', 35],
 ['Shrey', 22],
 ['Kulwendra', 23],
 ['Adi', 24]]

In [4]:
pd.DataFrame(data1,columns = ["Name","Marks"])

        Name  Marks
0      Alice     25
1        Bob     30
2    Charlie     35
3      Shrey     22
4  Kulwendra     23
5        Adi     24

In [6]:
data2 = {
    "Name": ["Alice", "Bob", "Charlie"],
    "Age": [25, 30, 35],
    "Marks":[67,87,90]
}

In [7]:
df2 = pd.DataFrame(data2)

In [8]:
df2

      Name  Age  Marks
0    Alice   25     67
1      Bob   30     87
2  Charlie   35     90

In [9]:
import numpy as np

In [10]:
arr = np.array([[1,2],[3,4],[5,6]])
arr

array([[1, 2],
       [3, 4],
       [5, 6]])

In [11]:
pd.DataFrame(arr,columns=["A","B"])

   A  B
0  1  2
1  3  4
2  5  6